import * as THREE from "three";
import { useEffect } from "react";

export default function Home() {
  return (
    <div>
      <main>
        <div>
          <h1 className="absolute">
            未到達の次元へ未到達の次元へ未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ 未到達の次元へ 未到達の次元へ 未到達の次元へ
            未到達の次元へ
            未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ未到達の次元へ
          </h1>
          <button type="button">ボタン</button>
          <canvas id="canvas"></canvas>
        </div>
      </main>
    </div>
  );
}
